---
kind: type
id: T:Autodesk.Revit.DB.Sweep
source: html/ed383459-badd-2323-4f73-0d94fd76ce0f.htm
---
# Autodesk.Revit.DB.Sweep

A sweep solid or void form.

## Syntax (C#)
```csharp
public class Sweep : GenericForm
```